notes/20260417203331-ranjangiri_fort_trek_2026_04_18_sat.org
:PROPERTIES:
:ID:       d92c68ee-5610-419d-8042-e900a5c82c71
:END:
#+title: ranjangiri fort trek <2026-04-18 Sat>
* Trek Overview
1. Trek Name: ranjangiri fort
2. Region: trimbakeshwar
3. Range:  trimbakeshwar
4. Base Village: Mulegaon
5. Height from MSL (ft): 2762
6. Type:
   - [X] hill fort
   - [ ] forest trail
   - [ ] plateau
7. Difficulty Level:
   1. [ ] easy
   2. [X] moderate
   3. [ ] difficult
8. Best Season:
   1. [X] winter
   2. [X] summer
   3. [ ] monsoon
9. Time taken to Climb [hrs]: 1 
10. Water Availability:
    1. [ ] yes
    2. [X] no
11. Suitable For:
    1. [X] beginners
    2. [X] regular trekkers
    3. [ ] families

* Schedule & Companions
1. Date:  <2026-04-18 Sat>
2. Team Members:
   1. vipul chawhan,
   2. Bapu sonje,
   3. datta gawali
   4. anil pethkar
   5. sunil jagtap
3. Wake-up Time: <2026-04-18 Sat 05:00>
4. Left Home: <2026-04-18 Sat 05:45>
5. Start Point / Meeting Place: ABB circle
6. Route Start Time: <2026-04-18 Sat 06:52>
7. Return Time: <2026-04-18 Sat 10:38>
8. Key Stops / Temples / Checkpoints:
   - none.
   - 

* Route Information
1. Route from Base City: ABB circle -> talegaon -> jategaon -> ranjangiri bottom.
2. Final Village Distance km: 21
3. Public Transport Availability: till anjaneri from there 8km ahead.
4. Parking / Auto / Petrol: at anjaneri phata.

* Historical / Mythological Background
1. Historical Importance: earlier was part of swarajya. was used to monitor the other forts.
   - watch fort.
2. Legends / Myths: none.
   - 
3. Nearby Heritage / Religious Sites: anjaneri.
   - 

* Key Landmarks & Attractions
1. Temples: none.
   - 
2. Structures (Bastions, Caves, Gates, etc.):
   - water tanks, looks of neighboring ranges, fort stair, ranjan like structure part of the fort.
3. Viewpoints (Ranges / Dams visible): anjaneri, gadgadya, 
   - waldevi, bahula, dangya sulka, aundha patta, paachya, anjaneri.
4. Not to Miss: 
   - karvande!

* Experience & Observations
1. Weather / Terrain: warm and cloudy.
2. Notable Sights: water tanks, 
3. Personal Experience: one of the best treks.
4. Vibe / Mood of Place: peaceful.
5. Tips for Future Trekkers: have a long pant cover your ankles and have a long sleeve.

* Facilities & Amenities
1. Food / Water Availability:  none
2. Accommodation / Prasadam Timings: none.
3. Shops / Auto Repair / Petrol Info: at anjaneri.
4. Guide Needed:
   1. [ ] yes
   2. [X] no

* Local Notes
1. Village Population / Details: 30
2. Major FoodCrops: none.
3. Local Culture / People:

* Photos & Media
1. [ ] Add photos
2. [ ] Add route map (GPS screenshot)
3. [ ] Add group photo

* Reflection
1. What I Loved Most:
2. What I’d Improve Next Time:
3. Recommend To:
4. Return Visit:
5. [ ] yes/no
6. [ ] (why?)


