20260417203331-ranjangiri_fort_trek_2026_04_18_sat.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-21 Tue 19:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ranjangiri fort trek &lt;2026-04-18 Sat&gt;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">ranjangiri fort trek <span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-18 Sat&gt;</span></span></h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org98db04e">Trek Overview</a></li>
<li><a href="#orgbac6583">Schedule &amp; Companions</a></li>
<li><a href="#org33a0145">Route Information</a></li>
<li><a href="#orgb6fd850">Historical / Mythological Background</a></li>
<li><a href="#org2aeec0f">Key Landmarks &amp; Attractions</a></li>
<li><a href="#orgee7d3ad">Experience &amp; Observations</a></li>
<li><a href="#org062a5e9">Facilities &amp; Amenities</a></li>
<li><a href="#org10f1eae">Local Notes</a></li>
<li><a href="#org71bc2e3">Photos &amp; Media</a></li>
<li><a href="#org4da9e02">Reflection</a></li>
</ul>
</div>
</div>
<div id="outline-container-org98db04e" class="outline-2">
<h2 id="org98db04e">Trek Overview</h2>
<div class="outline-text-2" id="text-org98db04e">
<ol class="org-ol">
<li>Trek Name: ranjangiri fort</li>
<li>Region: trimbakeshwar</li>
<li>Range:  trimbakeshwar</li>
<li>Base Village: Mulegaon</li>
<li>Height from MSL (ft): 2762</li>
<li>Type:
<ul class="org-ul">
<li class="on"><code>[X]</code> hill fort</li>
<li class="off"><code>[&#xa0;]</code> forest trail</li>
<li class="off"><code>[&#xa0;]</code> plateau</li>
</ul></li>
<li>Difficulty Level:
<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> easy</li>
<li class="on"><code>[X]</code> moderate</li>
<li class="off"><code>[&#xa0;]</code> difficult</li>
</ol></li>
<li>Best Season:
<ol class="org-ol">
<li class="on"><code>[X]</code> winter</li>
<li class="on"><code>[X]</code> summer</li>
<li class="off"><code>[&#xa0;]</code> monsoon</li>
</ol></li>
<li>Time taken to Climb [hrs]: 1</li>
<li>Water Availability:
<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> yes</li>
<li class="on"><code>[X]</code> no</li>
</ol></li>
<li>Suitable For:
<ol class="org-ol">
<li class="on"><code>[X]</code> beginners</li>
<li class="on"><code>[X]</code> regular trekkers</li>
<li class="off"><code>[&#xa0;]</code> families</li>
</ol></li>
</ol>
</div>
</div>

<div id="outline-container-orgbac6583" class="outline-2">
<h2 id="orgbac6583">Schedule &amp; Companions</h2>
<div class="outline-text-2" id="text-orgbac6583">
<ol class="org-ol">
<li>Date:  <span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-18 Sat&gt;</span></span></li>
<li>Team Members:
<ol class="org-ol">
<li>vipul chawhan,</li>
<li>Bapu sonje,</li>
<li>datta gawali</li>
<li>anil pethkar</li>
<li>sunil jagtap</li>
</ol></li>
<li>Wake-up Time: <span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-18 Sat 05:00&gt;</span></span></li>
<li>Left Home: <span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-18 Sat 05:45&gt;</span></span></li>
<li>Start Point / Meeting Place: ABB circle</li>
<li>Route Start Time: <span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-18 Sat 06:52&gt;</span></span></li>
<li>Return Time: <span class="timestamp-wrapper"><span class="timestamp">&lt;2026-04-18 Sat 10:38&gt;</span></span></li>
<li>Key Stops / Temples / Checkpoints:
<ul class="org-ul">
<li>none.</li>
<li></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org33a0145" class="outline-2">
<h2 id="org33a0145">Route Information</h2>
<div class="outline-text-2" id="text-org33a0145">
<ol class="org-ol">
<li>Route from Base City: ABB circle -&gt; talegaon -&gt; jategaon -&gt; ranjangiri bottom.</li>
<li>Final Village Distance km: 21</li>
<li>Public Transport Availability: till anjaneri from there 8km ahead.</li>
<li>Parking / Auto / Petrol: at anjaneri phata.</li>
</ol>
</div>
</div>

<div id="outline-container-orgb6fd850" class="outline-2">
<h2 id="orgb6fd850">Historical / Mythological Background</h2>
<div class="outline-text-2" id="text-orgb6fd850">
<ol class="org-ol">
<li>Historical Importance: earlier was part of swarajya. was used to monitor the other forts.
<ul class="org-ul">
<li>watch fort.</li>
</ul></li>
<li>Legends / Myths: none.
<ul class="org-ul">
<li></li>
</ul></li>
<li>Nearby Heritage / Religious Sites: anjaneri.
<ul class="org-ul">
<li></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org2aeec0f" class="outline-2">
<h2 id="org2aeec0f">Key Landmarks &amp; Attractions</h2>
<div class="outline-text-2" id="text-org2aeec0f">
<ol class="org-ol">
<li>Temples: none.
<ul class="org-ul">
<li></li>
</ul></li>
<li>Structures (Bastions, Caves, Gates, etc.):
<ul class="org-ul">
<li>water tanks, looks of neighboring ranges, fort stair, ranjan like structure part of the fort.</li>
</ul></li>
<li>Viewpoints (Ranges / Dams visible): anjaneri, gadgadya, 
<ul class="org-ul">
<li>waldevi, bahula, dangya sulka, aundha patta, paachya, anjaneri.</li>
</ul></li>
<li>Not to Miss: 
<ul class="org-ul">
<li>karvande!</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgee7d3ad" class="outline-2">
<h2 id="orgee7d3ad">Experience &amp; Observations</h2>
<div class="outline-text-2" id="text-orgee7d3ad">
<ol class="org-ol">
<li>Weather / Terrain: warm and cloudy.</li>
<li>Notable Sights: water tanks,</li>
<li>Personal Experience: one of the best treks.</li>
<li>Vibe / Mood of Place: peaceful.</li>
<li>Tips for Future Trekkers: have a long pant cover your ankles and have a long sleeve.</li>
</ol>
</div>
</div>

<div id="outline-container-org062a5e9" class="outline-2">
<h2 id="org062a5e9">Facilities &amp; Amenities</h2>
<div class="outline-text-2" id="text-org062a5e9">
<ol class="org-ol">
<li>Food / Water Availability:  none</li>
<li>Accommodation / Prasadam Timings: none.</li>
<li>Shops / Auto Repair / Petrol Info: at anjaneri.</li>
<li>Guide Needed:
<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> yes</li>
<li class="on"><code>[X]</code> no</li>
</ol></li>
</ol>
</div>
</div>

<div id="outline-container-org10f1eae" class="outline-2">
<h2 id="org10f1eae">Local Notes</h2>
<div class="outline-text-2" id="text-org10f1eae">
<ol class="org-ol">
<li>Village Population / Details: 30</li>
<li>Major FoodCrops: none.</li>
<li>Local Culture / People:</li>
</ol>
</div>
</div>

<div id="outline-container-org71bc2e3" class="outline-2">
<h2 id="org71bc2e3">Photos &amp; Media</h2>
<div class="outline-text-2" id="text-org71bc2e3">
<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> Add photos</li>
<li class="off"><code>[&#xa0;]</code> Add route map (GPS screenshot)</li>
<li class="off"><code>[&#xa0;]</code> Add group photo</li>
</ol>
</div>
</div>

<div id="outline-container-org4da9e02" class="outline-2">
<h2 id="org4da9e02">Reflection</h2>
<div class="outline-text-2" id="text-org4da9e02">
<ol class="org-ol">
<li>What I Loved Most:</li>
<li>What I’d Improve Next Time:</li>
<li>Recommend To:</li>
<li>Return Visit:</li>
<li class="off"><code>[&#xa0;]</code> yes/no</li>
<li class="off"><code>[&#xa0;]</code> (why?)</li>
</ol>
</div>
</div>
</div>
</body>
</html>